DafeCpp/product_dev_course/projects/bench_controller/firmware/esp32/sdkconfig.defaults
# Контур 500 Гц: 2 мс = 2 тика планировщика при 1 кГц (как RC Vehicle).
CONFIG_FREERTOS_HZ=1000

# ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# Новый TWAI node-API (esp_driver_twai) — используем onchip-контроллер.
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
